wwwroot/Files/request_data.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:ICUTech.Intf-IICUTech">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:Login soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <UserName xsi:type="xsd:string">%1</UserName>
         <Password xsi:type="xsd:string">%2</Password>
         <IPs xsi:type="xsd:string">%3</IPs>
      </urn:Login>
   </soapenv:Body>
</soapenv:Envelope>